app/controllers/SiteController.php

    public function actionRecoveryPassword() {
        $model = new PasswordResetRequestForm();
        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            /* @var $user Person */
            $user = Person::findOne([
                'status' => Person::STATUS_ACTIVE,
                'email' => $model->email,
            ]);
---
SELECT EXISTS(SELECT * FROM `person` WHERE (`email`='user4@mail.ruru') AND (`status`=10))