app/models/PasswordResetRequestForm.php

    public function sendEmail() {
        /* @var $user Person */
        $user = Person::findOne([
                'status' => Person::STATUS_ACTIVE,
                'email' => $this->email,
        ]);

        if (!$user) {
            return false;
        }

        if (!Person::isPasswordResetTokenValid($user->password_reset_token)) {
            $user->generatePasswordResetToken();
            if (!$user->save()) {
---
SELECT * FROM `person` WHERE (`status`=10) AND (`email`='user4@mail.ruru')
UPDATE `person` SET `password_reset_token`='5MkQmng1d-AWwKfU52vTKxLv9fSUQLdv_1486227802', `updated_at`=SYSDATE() WHERE `id`='5'