app/models/Person.php

SELECT * FROM `person` WHERE (`id`='1') AND (`status`=10)
---
    public static function findIdentity($id) {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `person` WHERE (`username`='admin') AND (`status`=10)
---
    public static function findByUsername($username) {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `person` WHERE (`password_reset_token`='NevKMkMQij-pmu4vH5FweACmTAlqYmce_1486913285') AND (`status`=10)
---
    public static function findByPasswordResetToken($token) {
        if (!static::isPasswordResetTokenValid($token)) {
            return null;
        }

        return static::findOne([
                'password_reset_token' => $token,
                'status' => self::STATUS_ACTIVE,
        ]);

SELECT * FROM `person` WHERE (`auth_key`='uddcMdVhSmFxmh-4dQLhpFonWkh3hY4Ro') AND (`status`=1)
---
    public static function approvement($token) {
        if ($user = static::findOne([
                    'auth_key' => $token,
                    'status' => self::STATUS_APPROVE
                ])) {