app/models/SignupForm.php

INSERT INTO `person` (`username`, `email`, `pass_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('user1', 'user1@mail.ruru', '$2y$13$HGp5YEceldI7B35V5eWst.I/6zcnbmnegWmEtLBOXIrqp6ZFJiv36', 'pshMZDUckCHSiYzCn_JY9IXxoth_lMXj', 1, SYSDATE(), SYSDATE())
---
    public function signup() {
        if (!$this->validate()) {
            return null;
        }

        $user = new Person();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->status = Person::STATUS_APPROVE;
        $user->created_at = '2000-01-01 00:00:00';
        $user->updated_at = '2000-01-01 00:00:00';

        if ($user->save())

SELECT * FROM `person` WHERE (`id`='4') AND (`status`=1)
---
    public function sendApproveEmail($id=0) {
        $user = Person::findOne([
            'id'=>$id,
            'status' => Person::STATUS_APPROVE,
        ]);